In [2]:
import numpy as np
import pandas as pd

## Apply

In [4]:
df = pd.DataFrame(
    {'tweet_id':[1, 2],
    'content':['Vote for Biden', 'Let us make America great again!']}
)
df

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [9]:
# Return tweet contents with len greater than 15
df[df['content'].apply(len) > 15]

   tweet_id                           content
1         2  Let us make America great again!

In [7]:
df = pd.DataFrame(
    {
        'id': [2,3,7,8,9],
        'name':['Meir', 'Michael','Addilyn','Juan','Kannon'],
        'salary':[34,38,74,61,77]
    }
)
df

   id     name  salary
0   2     Meir      34
1   3  Michael      38
2   7  Addilyn      74
3   8     Juan      61
4   9   Kannon      77

In [11]:
df[df['name']=='Meir']['id'][0]

2

In [22]:
df['bouns']= df.apply(
    lambda x:x['salary'] if x['id']%2==1 and not x['name'].startswith('M') else 0,
axis =1)
df

   id     name  salary  bouns
0   2     Meir      34      0
1   3  Michael      38      0
2   7  Addilyn      74     74
3   8     Juan      61      0
4   9   Kannon      77     77

## value_counts()

In [2]:
person = pd.DataFrame({
    'id':[1,2,3],
    'email':['a@b.com','c@d.com','a@b.com']
})
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [3]:
person.value_counts('email')

email
a@b.com    2
c@d.com    1
Name: count, dtype: int64

## Sort

In [3]:
employee = pd.DataFrame({
    "id": [1, 2, 3, 4],
    'salary': [100, 200, 300, 230]
})
employee

   id  salary
0   1     100
1   2     200
2   3     300
3   4     230

In [18]:
employee.sort_values('salary', ascending=False).reset_index().iat[3,2]

100

In [16]:
len(employee)

4

In [19]:
df = pd.DataFrame({
    'id':[1,2],
    'salary':[100,100]
})
df

   id  salary
0   1     100
1   2     100

In [23]:
df.drop_duplicates(subset=['salary'], inplace=True)
df

   id  salary
0   1     100

In [4]:
employee = pd.DataFrame({
    'customer_id':[1,1,2,3,3],
    'amount':[549,834,394,657,258]
})
employee

   customer_id  amount
0            1     549
1            1     834
2            2     394
3            3     657
4            3     258

In [6]:
employee[employee['amount']>500].drop_duplicates(subset=['customer_id'])

   customer_id  amount
0            1     549
3            3     657

In [15]:
data = pd.DataFrame({
    'A':[1,1,2,2,2,3,3,3],
    'B':['A','b','c','d','e','f','g','h']
})
data

   A  B
0  1  A
1  1  b
2  2  c
3  2  d
4  2  e
5  3  f
6  3  g
7  3  h

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [13]:
data['A'].drop_duplicates()

0    1
2    2
5    3
Name: A, dtype: int64

In [14]:
data.drop_duplicates(subset='A')

   A  B
0  1  A
2  2  c
5  3  f